sakshamg96/Nucleo-MCU1/MCU1/stm32f4xx_drivers/drivers/Inc/stm32f46xx.h
/*
 * stm32f46xx.h
 *
 *  Created on: Oct 18, 2020
 *      Author: saksham
 */
#ifndef INC_STM32F46XX_H_
#define INC_STM32F46XX_H_

#include <stdint.h>
#include <stddef.h>

#define __vo volatile
#define __weak __attribute__((weak))

/*********************** Processor specific details ********************/
/*
 * ARM Cortex Mx processor register addresses
 */

typedef struct
{
	__vo uint32_t ISER[8];				/* |< Interrupt Set-enable Registers					Address offset: 0x00-0x1C >*/
		 uint32_t RESERVED[24];			/* |< Address offset: 0x20-0x7C >*/
	__vo uint32_t ICER[8];				/* |< Interrupt Clear-enable Registers					Address offset: 0x80-0x9C >*/
		 uint32_t RESERVED1[24];			/* |< Address offset: 0xA0-0xFC >*/
	__vo uint32_t ISPR[8];				/* |< Interrupt Set-pending Registers					Address offset: 0x00-0x1C >*/
		 uint32_t RESERVED2[24];			/* |<  >*/
	__vo uint32_t ICPR[8];				/* |< Interrupt Clear-pending Registers					Address offset: 0x80-0x9C >*/
		 uint32_t RESERVED3[24];			/* |<  >*/
	__vo uint32_t IABR[8];				/* |< Interrupt Active Bit Registers					Address offset: 0x00-0x1C >*/
	 	 uint32_t RESERVED4[56];			/* |<  >*/
	__vo uint32_t IPR[60];				/* |< Interrupt Priority Registers						Address offset: 0x00-0xEF >*/
	//__vo uint32_t STIR;				/* |< TODO >*/
}NVIC_RegDef_t;

#define NVIC_BASEADDR	0xE000E100U	/* |< Base address of Nested Vectored Interrupt Controller >*/

#define NVIC	((NVIC_RegDef_t*)NVIC_BASEADDR)

#define NO_PR_BITS_IMPLEMENTED	4

/*
 * base address of SRAM and flash memories
 */
#define FLASH_BASEADDR			0x08000000U			/* Base address of Flash memory */
#define SRAM1_BASEADDR			0x20000000U			/* Base address of SRAM1 memory */
#define SRAM2_BASEADDR			0x2001C000U			/* Base address of SRAM2 memory */
#define SRAM 					SRAM1_BASEADDR		/* SRAM1 is the main SRAM */
#define ROM_BASEADDR			0x1FFF0000U			/* Base address of Rom/System memory */

/*
 * base address of APB and AHB peripheral bus
 */

#define PERIPH_BASEADDR				0x40000000U
#define APB1PERIPH_BASEADDR			PERIPH_BASEADDR		/* Base address of APB1 peripheral */
#define APB2PERIPH_BASEADDR			0x40010000U			/* Base address of APB2 peripheral */
#define AHB1PERIPH_BASEADDR			0x40020000U			/* Base address of AHB1 peripheral */
#define AHB2PERIPH_BASEADDR			0x50000000U			/* Base address of AHB2 peripheral */

/*
 * 	Base address of peripherals hanging on AHB1 bus
 */

#define GPIOA_BASEADDR				(AHB1PERIPH_BASEADDR + 0x0000)		/* Base address of GPIOA peripheral */
#define GPIOB_BASEADDR				(AHB1PERIPH_BASEADDR + 0x0400)		/* Base address of GPIOB peripheral */
#define GPIOC_BASEADDR				(AHB1PERIPH_BASEADDR + 0x0800)		/* Base address of GPIOC peripheral */
#define GPIOD_BASEADDR				(AHB1PERIPH_BASEADDR + 0x0C00)		/* Base address of GPIOD peripheral */
#define GPIOE_BASEADDR				(AHB1PERIPH_BASEADDR + 0x1000)		/* Base address of GPIOE peripheral */
#define GPIOF_BASEADDR				(AHB1PERIPH_BASEADDR + 0x1400)		/* Base address of GPIOF peripheral */
#define GPIOG_BASEADDR				(AHB1PERIPH_BASEADDR + 0x1800)		/* Base address of GPIOG peripheral */
#define GPIOH_BASEADDR				(AHB1PERIPH_BASEADDR + 0x1C00)		/* Base address of GPIOH peripheral */

#define RCC_BASEADDR				(AHB1PERIPH_BASEADDR + 0x3800)		/* Base address of RCC */

/*
 * 	Base address of peripherals hanging on APB1 bus
 */

#define I2C1_BASEADDR				(APB1PERIPH_BASEADDR + 0x5400)		/* Base address of I2C1 peripheral */
#define I2C2_BASEADDR				(APB1PERIPH_BASEADDR + 0x5800)		/* Base address of I2C2 peripheral */
#define I2C3_BASEADDR				(APB1PERIPH_BASEADDR + 0x5C00)		/* Base address of I2C3 peripheral */
#define SPI2_BASEADDR				(APB1PERIPH_BASEADDR + 0x3800)		/* Base address of SPI2 peripheral */
#define SPI3_BASEADDR				(APB1PERIPH_BASEADDR + 0x3C00)		/* Base address of SPI3 peripheral */
#define USART2_BASEADDR				(APB1PERIPH_BASEADDR + 0x4400)		/* Base address of USART2 peripheral */
#define USART3_BASEADDR				(APB1PERIPH_BASEADDR + 0x4800)		/* Base address of USART3 peripheral */
#define UART4_BASEADDR				(APB1PERIPH_BASEADDR + 0x5000)		/* Base address of UART4 peripheral */
#define UART5_BASEADDR				(APB1PERIPH_BASEADDR + 0x4C00)		/* Base address of UART5 peripheral */

/*
 * 	Base address of peripherals hanging on APB2 bus
 */

#define SPI1_BASEADDR				(APB2PERIPH_BASEADDR + 0x3000)		/* Base address of SPI1 peripheral */
#define SPI4_BASEADDR				(APB2PERIPH_BASEADDR + 0x3400)		/* Base address of SPI4 peripheral */
#define USART1_BASEADDR				(APB2PERIPH_BASEADDR + 0x1000)		/* Base address of USART1 peripheral */
#define USART6_BASEADDR				(APB2PERIPH_BASEADDR + 0x1400)		/* Base address of USART6 peripheral */
#define EXTI_BASEADDR				(APB2PERIPH_BASEADDR + 0x3C00)		/* Base address of EXTI peripheral */
#define SYSCFG_BASEADDR				(APB2PERIPH_BASEADDR + 0x3800)		/* Base address of SYSCFG peripheral */

/*
 * Base address of NVIC registers
 */
#define ISER0_BASEADDR

/********************* peripheral register definition structures *******************/

typedef struct
{
	__vo uint32_t MODER;					/*|< GPIO port mode register					Address offset: 0x00 */
	__vo uint32_t OTYPER;					/*|< GPIO port output type register				Address offset: 0x04 */
	__vo uint32_t OSPEEDER;					/*|< GPIO port output speed register			Address offset: 0x08 */
	__vo uint32_t PUPDR;					/*|< GPIO port pull-up/pull-down register		Address offset: 0x0C */
	__vo uint32_t IDR;						/*|< GPIO port pull-up/pull-down register		Address offset: 0x10 */
	__vo uint32_t ODR;						/*|< GPIO port input data register				Address offset: 0x14 */
	__vo uint32_t BSRR;						/*|< GPIO port bit set/reset register			Address offset: 0x18 */
	__vo uint32_t LCKR;						/*|< GPIO port configuration lock register	Address offset: 0x1C */
	__vo uint32_t AFR[2];					/*|< AFR[0]: GPIO alternate function low register, AFR[1]: GPIO alternate function high register			Address offset: 0x20-0x24 */
}GPIO_RegDef_t;

typedef struct
{
	__vo uint32_t CR;					/*|< RCC clock control register					Address offset: 0x00 */
	__vo uint32_t PLLCFGR;				/*|< RCC PLL configuration register				Address offset: 0x04 */
	__vo uint32_t CFGR;					/*|< RCC clock configuration register			Address offset: 0x08 */
	__vo uint32_t CIR;					/*|< RCC clock interrupt register				Address offset: 0x0C */
	__vo uint32_t AHB1RSTR;				/*|< RCC AHB1 peripheral reset register			Address offset: 0x10 */
	__vo uint32_t AHB2RSTR;				/*|< RCC AHB2 peripheral reset register			Address offset: 0x14 */
	__vo uint32_t AHB3RSTR;				/*|< RCC AHB3 peripheral reset register			Address offset: 0x18 */
		 uint32_t RESERVED;				/*|< Address offset: 0x1C */
	__vo uint32_t APB1RSTR;				/*|< RCC APB1 peripheral reset register			Address offset: 0x20 */
	__vo uint32_t APB2RSTR;				/*|< RCC APB2 peripheral reset register			Address offset: 0x24 */
		 uint32_t RESERVED1[2];			/*|< Address offset: 0x28-0x2C */
	__vo uint32_t AHB1ENR;				/*|< RCC AHB1 peripheral clock enable register			Address offset: 0x30 */
	__vo uint32_t AHB2ENR;				/*|< RCC AHB2 peripheral clock enable register			Address offset: 0x34 */
	__vo uint32_t AHB3ENR;				/*|< RCC AHB3 peripheral clock enable register			Address offset: 0x38 */
	 	 uint32_t RESERVED2;				/*|< Address offset: 0x3C */
	__vo uint32_t APB1ENR;				/*|< RCC APB1 peripheral clock enable register			Address offset: 0x40 */
	__vo uint32_t APB2ENR;				/*|< RCC APB2 peripheral clock enable register			Address offset: 0x44 */
		 uint32_t RESERVED3[2];			/*|< Address offset: 0x48-0x4C */
	__vo uint32_t AHB1LPENR;			/*|< RCC AHB1 peripheral clock enable in low power mode register		Address offset: 0x50 */
	__vo uint32_t AHB2LPENR;			/*|< RCC AHB2 peripheral clock enable in low power mode register		Address offset: 0x54 */
	__vo uint32_t AHB3LPENR;			/*|< RCC AHB3 peripheral clock enable in low power mode register		Address offset: 0x58 */
	__vo uint32_t RESERVED4;				/*|< Address offset: 0x5C */
	__vo uint32_t APB1LPENR;			/*|< RCC APB1 peripheral clock enable in low power mode register		Address offset: 0x60 */
	__vo uint32_t APB2LPENR;			/*|< RCC APB2 peripheral clock enable in low power mode register		Address offset: 0x64 */
		 uint32_t RESERVED5[2];			/*|< Address offset: 0x68-0x6C */
	__vo uint32_t BDCR;					/*|< RCC Backup domain control register						Address offset: 0x70 */
	__vo uint32_t CSR;					/*|< RCC clock control & status register					Address offset: 0x74 */
	__vo uint32_t RESERVED6[2];			/*|< Address offset: 0x78-0x7C */
	__vo uint32_t SSCGR;				/*|< RCC spread spectrum clock generation register			Address offset: 0x80 */
	__vo uint32_t PLLI2SCFGR;			/*|< RCC PLLI2S configuration register						Address offset: 0x84 */
	__vo uint32_t PLLSAICFGR;			/*|< RCC PLLI2S configuration register						Address offset: 0x88 */
	__vo uint32_t DCKCFGR;				/*|< RCC Dedicated Clock Configuration Register				Address offset: 0x8C */
	__vo uint32_t CKGATENR;				/*|< RCC clocks gated enable register						Address offset: 0x90 */
	__vo uint32_t DCKCFGR2;				/*|< RCC dedicated clocks configuration register 2			Address offset: 0x94 */

}RCC_RegDef_t;

typedef struct
{
	__vo uint32_t IMR;					/* |< Interrupt mask register				Address offset: 0x00 >*/
	__vo uint32_t EMR;					/* |< Event mask register					Address offset: 0x04 >*/
	__vo uint32_t RTSR;					/* |< Rising trigger selection register		Address offset: 0x08 >*/
	__vo uint32_t FTSR;					/* |< Falling trigger selection register	Address offset: 0x0C >*/
	__vo uint32_t SWIER;				/* |< Software interrupt event register		Address offset: 0x10 >*/
	__vo uint32_t PR;					/* |< Pending register						Address offset: 0x14 >*/
}EXTI_RegDef_t;

typedef struct
{
	__vo uint32_t MEMRMP;				/* |< SYSCFG memory remap register						Address offset: 0x00 >*/
	__vo uint32_t PMC;					/* |< SYSCFG peripheral mode configuration register		Address offset: 0x04 >*/
	__vo uint32_t EXTICR[4];			/* |< SYSCFG external interrupt configuration register	Address offset: 0x08-0x14 >*/
		 uint32_t RESERVED1[2];			/* |< Address offset: 0x18-0x1C >*/
	__vo uint32_t CMPCR;				/* |< Compensation cell control registerr				Address offset: 0x20 >*/
		 uint32_t RESERVED2[2];			/* |< Address offset: 0x24-0x28 >*/
	__vo uint32_t CFGR;					/* |< SYSCFG configuration register						Address offset: 0x2C >*/
}SYSCFG_RegDef_t;

