sakshamg96/Nucleo-MCU1/MCU1/stm32f4xx_drivers/drivers/Inc/stm32f46xx.h
typedef struct {
	__vo uint32_t CR[2];			/* |< SPI control register				Address offset: 0x00-0x04 > */
	__vo uint32_t SR;				/* |< SPI status register				Address offset: 0x08 > */
	__vo uint32_t DR;				/* |< SPI data register					Address offset: 0x0C > */
	__vo uint32_t CRCPR;			/* |< SPI CRC polynomial register		Address offset: 0x10 > */
	__vo uint32_t RXCRCR;			/* |< SPI RX CRC register				Address offset: 0x14 > */
	__vo uint32_t TXCRCR;			/* |< SPI TX CRC register				Address offset: 0x18 > */
	__vo uint32_t I2SCFGR;			/* |< SPI_I2S configuration register	Address offset: 0x1C > */
	__vo uint32_t I2SPR;			/* |< SPI_I2S prescalar register		Address offset: 0x20 > */

}SPI_RegDef_t;

typedef struct {
	__vo uint32_t CR[2];			/* |< I2C control register				Address offset: 0x00-0x04 > */
	__vo uint32_t OAR[2];			/* |< I2C Own Address register			Address offset: 0x08 > */
	__vo uint32_t DR;				/* |< I2C Data register					Address offset: 0x10 > */
	__vo uint32_t SR[2];			/* |< I2C Status Register				Address offset: 0x14-0x18 > */
	__vo uint32_t CCR;				/* |< I2C Clock Control register		Address offset: 0x1C > */
	__vo uint32_t TRISE;			/* |< I2C TRISE register				Address offset: 0x20 > */
	__vo uint32_t FLTR;				/* |< I2C FLTR register					Address offset: 0x24 > */

}I2C_RegDef_t;

typedef struct {
	__vo uint32_t SR;				/* |< USART status register					Address offset: 0x00 > */
	__vo uint32_t DR;				/* |< USART data register					Address offset: 0x04 > */
	__vo uint32_t BRR;				/* |< USART baud rate register				Address offset: 0x08 > */
	__vo uint32_t CR1;				/* |< USART control register 1				Address offset: 0x0C > */
	__vo uint32_t CR2;				/* |< USART control register 2				Address offset: 0x10 > */
	__vo uint32_t CR3;				/* |< USART control register 3				Address offset: 0x14 > */
	__vo uint32_t GTPR;				/* |< USART guard time and prescaler		Address offset: 0x18 > */

}USART_RegDef_t;

/*
 *  peripheral definitions
 */

#define GPIOA		((GPIO_RegDef_t*)GPIOA_BASEADDR)
#define GPIOB		((GPIO_RegDef_t*)GPIOB_BASEADDR)
#define GPIOC		((GPIO_RegDef_t*)GPIOC_BASEADDR)
#define GPIOD		((GPIO_RegDef_t*)GPIOD_BASEADDR)
#define GPIOE		((GPIO_RegDef_t*)GPIOE_BASEADDR)
#define GPIOF		((GPIO_RegDef_t*)GPIOF_BASEADDR)
#define GPIOG		((GPIO_RegDef_t*)GPIOG_BASEADDR)
#define GPIOH		((GPIO_RegDef_t*)GPIOH_BASEADDR)

#define RCC			((RCC_RegDef_t*)RCC_BASEADDR)

#define EXTI		((EXTI_RegDef_t*)EXTI_BASEADDR)

#define SYSCFG		((SYSCFG_RegDef_t*)SYSCFG_BASEADDR)

#define	SPI1		((SPI_RegDef_t*)SPI1_BASEADDR)
#define	SPI2		((SPI_RegDef_t*)SPI2_BASEADDR)
#define	SPI3		((SPI_RegDef_t*)SPI3_BASEADDR)
#define	SPI4		((SPI_RegDef_t*)SPI4_BASEADDR)

#define	I2C1		((I2C_RegDef_t*)I2C1_BASEADDR)
#define	I2C2		((I2C_RegDef_t*)I2C2_BASEADDR)
#define	I2C3		((I2C_RegDef_t*)I2C3_BASEADDR)

#define	USART1		((USART_RegDef_t*)USART1_BASEADDR)
#define	USART2		((USART_RegDef_t*)USART2_BASEADDR)
#define	USART3		((USART_RegDef_t*)USART3_BASEADDR)
#define	UART4		((USART_RegDef_t*)UART4_BASEADDR)
#define	UART5		((USART_RegDef_t*)UART5_BASEADDR)
#define	USART6		((USART_RegDef_t*)USART6_BASEADDR)

/*
 * Clock enable macros for GPIOx peripherals
 */

#define GPIOA_PCLK_EN()		( RCC->AHB1ENR |= (1 << 0) )
#define GPIOB_PCLK_EN()		( RCC->AHB1ENR |= (1 << 1) )
#define GPIOC_PCLK_EN()		( RCC->AHB1ENR |= (1 << 2) )
#define GPIOD_PCLK_EN()		( RCC->AHB1ENR |= (1 << 3) )
#define GPIOE_PCLK_EN()		( RCC->AHB1ENR |= (1 << 4) )
#define GPIOF_PCLK_EN()		( RCC->AHB1ENR |= (1 << 5) )
#define GPIOG_PCLK_EN()		( RCC->AHB1ENR |= (1 << 6) )
#define GPIOH_PCLK_EN()		( RCC->AHB1ENR |= (1 << 7) )

/*
 * Clock enable for I2Cx peripherals
 */

#define I2C1_PCLK_EN()		( RCC->APB1ENR |= (1 << 21) )
#define I2C2_PCLK_EN()		( RCC->APB1ENR |= (1 << 22) )
#define I2C3_PCLK_EN()		( RCC->APB1ENR |= (1 << 23) )

/*
 * Clock enable for SPIx peripherals
 */

#define SPI1_PCLK_EN()		( RCC->APB2ENR |= (1 << 12) )
#define SPI2_PCLK_EN()		( RCC->APB1ENR |= (1 << 14) )
#define SPI3_PCLK_EN()		( RCC->APB1ENR |= (1 << 15) )
#define SPI4_PCLK_EN()		( RCC->APB2ENR |= (1 << 13) )

/*
 * Clock enable for USARTx peripherals
 */

#define USART1_PCLK_EN()		( RCC->APB2ENR |= (1 << 4) )
#define USART2_PCLK_EN()		( RCC->APB2ENR |= (1 << 17) )
#define USART3_PCLK_EN()		( RCC->APB2ENR |= (1 << 18) )
#define UART4_PCLK_EN()			( RCC->APB2ENR |= (1 << 19) )
#define UART5_PCLK_EN()			( RCC->APB2ENR |= (1 << 20) )
#define USART6_PCLK_EN()		( RCC->APB2ENR |= (1 << 5) )

/*
 * Clock enable for SYSCFG peripherals
 */

#define SYSCFG_PCLK_EN()		( RCC->APB2ENR |= (1 << 14) )

/*
 * Clock disable macros for GPIOx peripherals
 */

#define GPIOA_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 0) )
#define GPIOB_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 1) )
#define GPIOC_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 2) )
#define GPIOD_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 3) )
#define GPIOE_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 4) )
#define GPIOF_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 5) )
#define GPIOG_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 6) )
#define GPIOH_PCLK_DI()		( RCC->AHB1ENR &= ~(1 << 7) )

/*
 * Clock enable for I2Cx peripherals
 */

#define I2C1_PCLK_DI()		( RCC->APB1ENR &= ~(1 << 21) )
#define I2C2_PCLK_DI()		( RCC->APB1ENR &= ~(1 << 22) )
#define I2C3_PCLK_DI()		( RCC->APB1ENR &= ~(1 << 23) )

/*
 * Clock enable for SPIx peripherals
 */

#define SPI1_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 12) )
#define SPI2_PCLK_DI()		( RCC->APB1ENR &= ~(1 << 14) )
#define SPI3_PCLK_DI()		( RCC->APB1ENR &= ~(1 << 15) )
#define SPI4_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 13) )

/*
 * Clock enable for USARTx peripherals
 */

#define USART1_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 4) )
#define USART2_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 17) )
#define USART3_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 18) )
#define UART4_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 19) )
#define UART5_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 20) )
#define USART6_PCLK_DI()		( RCC->APB2ENR &= ~(1 << 5) )

/*
 * Clock enable for SYSCFG peripherals
 */

#define SYSCFG_PCLK_DI		( RCC->APB2ENR &= ~(1 << 14) )

/*
 * Macros to reset GPIOx peripherals
 */
#define GPIOA_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 0 ) );   ( RCC->AHB1RSTR &= ~( 1 << 0 ) );  }while(0)			//do while loop for executing multiple statements in a single C macro
#define GPIOB_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 1 ) );   ( RCC->AHB1RSTR &= ~( 1 << 1 ) );  }while(0)
#define GPIOC_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 2 ) );   ( RCC->AHB1RSTR &= ~( 1 << 2 ) );  }while(0)
#define GPIOD_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 3 ) );   ( RCC->AHB1RSTR &= ~( 1 << 3 ) );  }while(0)
#define GPIOE_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 4 ) );   ( RCC->AHB1RSTR &= ~( 1 << 4 ) );  }while(0)
#define GPIOF_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 5 ) );   ( RCC->AHB1RSTR &= ~( 1 << 5 ) );  }while(0)
#define GPIOG_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 6 ) );   ( RCC->AHB1RSTR &= ~( 1 << 6 ) );  }while(0)
#define GPIOH_REG_RESET()	do { ( RCC->AHB1RSTR |= ( 1 << 7 ) );   ( RCC->AHB1RSTR &= ~( 1 << 7	 ) );  }while(0)

