sakshamg96/Nucleo-MCU1/MCU1/stm32f4xx_drivers/drivers/Inc/stm32f46xx.h
/*
 * Macros to reset SPIx peripherals
 */
#define SPI1_REG_RESET()	do { ( RCC->APB2RSTR |= ( 1 << 12 ) );   ( RCC->APB2RSTR &= ~( 1 << 12 ) );  }while(0)
#define SPI2_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 14 ) );   ( RCC->APB1RSTR &= ~( 1 << 14 ) );  }while(0)
#define SPI3_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 15 ) );   ( RCC->APB1RSTR &= ~( 1 << 15 ) );  }while(0)
#define SPI4_REG_RESET()	do { ( RCC->APB2RSTR |= ( 1 << 13 ) );   ( RCC->APB2RSTR &= ~( 1 << 13 ) );  }while(0)

/*
 * Macros to reset I2Cx peripherals
 */
#define I2C1_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 21 ) );   ( RCC->APB1RSTR &= ~( 1 << 21 ) );  }while(0)
#define I2C2_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 22 ) );   ( RCC->APB1RSTR &= ~( 1 << 22 ) );  }while(0)
#define I2C3_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 23 ) );   ( RCC->APB1RSTR &= ~( 1 << 23 ) );  }while(0)

/*
 * Macros to reset USARTx peripherals
 */
#define USART1_REG_RESET()	do { ( RCC->APB2RSTR |= ( 1 << 4 ) );   ( RCC->APB2RSTR &= ~( 1 << 4 ) );  }while(0)
#define USART2_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 17 ) );   ( RCC->APB1RSTR &= ~( 1 << 17 ) );  }while(0)
#define USART3_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 18 ) );   ( RCC->APB1RSTR &= ~( 1 << 18 ) );  }while(0)
#define UART4_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 19 ) );   ( RCC->APB1RSTR &= ~( 1 << 19 ) );  }while(0)
#define UART5_REG_RESET()	do { ( RCC->APB1RSTR |= ( 1 << 20 ) );   ( RCC->APB1RSTR &= ~( 1 << 20 ) );  }while(0)
#define USART6_REG_RESET()	do { ( RCC->APB2RSTR |= ( 1 << 5 ) );   ( RCC->APB2RSTR &= ~( 1 << 5 ) );  }while(0)

/*
 * This macro returns a code (between 0 & 7) for corresponding GPIO port
 */
#define GPIO_BASEADDR_TO_CODE(x)		( (x == GPIOA) ? 0 : \
										  (x == GPIOB) ? 1 : \
										  (x == GPIOC) ? 2 : \
										  (x == GPIOD) ? 3 : \
										  (x == GPIOE) ? 4 : \
										  (x == GPIOF) ? 5 : \
										  (x == GPIOG) ? 6 : \
										  (x == GPIOH) ? 7 : 0)

/*
 * IRQ(Interrupt request) Numbers of STM32F46x MCU
 */
//EXTI
#define IRQ_NO_EXTI0		6
#define IRQ_NO_EXTI1		7
#define IRQ_NO_EXTI2		8
#define IRQ_NO_EXTI3		9
#define IRQ_NO_EXTI4		10
#define IRQ_NO_EXTI9_5		23
#define IRQ_NO_EXTI15_10	40

//SPI
#define IRQ_NO_SPI1		35
#define IRQ_NO_SPI2		36
#define IRQ_NO_SPI3		51
#define IRQ_NO_SPI4		84

//I2C
#define IRQ_NO_I2C1_EV		31
#define IRQ_NO_I2C1_ER		32
#define IRQ_NO_I2C2_EV		33
#define IRQ_NO_I2C2_ER		34
#define IRQ_NO_I2C3_EV		72
#define IRQ_NO_I2C3_ER		73

//USART
#define IRQ_NO_USART1		37
#define IRQ_NO_USART2		38
#define IRQ_NO_USART3		39
#define IRQ_NO_UART4		52
#define IRQ_NO_UART5		53
#define IRQ_NO_USART6		71

/*
 * Priority number
 */
#define NVIC_IRQ_PRIO0		0
#define NVIC_IRQ_PRIO1		1
#define NVIC_IRQ_PRIO2		2
#define NVIC_IRQ_PRIO3		3
#define NVIC_IRQ_PRIO4		4
#define NVIC_IRQ_PRIO5		5
#define NVIC_IRQ_PRIO6		6
#define NVIC_IRQ_PRIO7		7
#define NVIC_IRQ_PRIO8		8
#define NVIC_IRQ_PRIO9		9
#define NVIC_IRQ_PRIO10		10
#define NVIC_IRQ_PRIO11		11
#define NVIC_IRQ_PRIO12		12
#define NVIC_IRQ_PRIO13		13
#define NVIC_IRQ_PRIO14		14
#define NVIC_IRQ_PRIO15		15

/*
 * Some general macros
 */

#define ENABLE 		1
#define DISABLE 	0
#define SET 		ENABLE
#define RESET 		DISABLE
#define SYSCLK_SPEED_HSI	16000000UL
#define SYSCLK_SPEED_HSE	8000000UL

/******************************************************************************/
/*				Bit position definition of RCC Peripheral					***/
/******************************************************************************/
//CFGR
#define RCC_CFGR_PPRE2		10
#define RCC_CFGR_PPRE1		13
#define RCC_CFGR_HPRE		4

/******************************************************************************/
/*				Bit position definition of SPI Peripheral					***/
/******************************************************************************/
//CR1
#define SPI_CR1_CPHA		0
#define SPI_CR1_CPOL		1
#define SPI_CR1_MSTR		2
#define SPI_CR1_BR			3
#define SPI_CR1_SPE			6
#define SPI_CR1_SSI			8
#define SPI_CR1_SSM			9
#define SPI_CR1_RXONLY		10
#define SPI_CR1_DFF			11
#define SPI_CR1_BIDIOE		14
#define SPI_CR1_BIDIMODE	15

//CR2
#define SPI_CR2_SSOE		2
#define SPI_CR2_ERRIE		5
#define SPI_CR2_RXNEIE		6
#define SPI_CR2_TXEIE		7

//SR
#define SPI_SR_RXNE		0
#define SPI_SR_TXE		1
#define SPI_SR_CHSIDE	2
#define SPI_SR_UDR		3
#define SPI_SR_CRCERR	4
#define SPI_SR_MODF		5
#define SPI_SR_OVR		6
#define SPI_SR_BSY		7
#define SPI_SR_FRE		8

/******************************************************************************/
/*				Bit position definition of I2C Peripheral					***/
/******************************************************************************/
//CR1
#define	I2C_CR1_PE			0
#define	I2C_CR1_SMBUS		1
#define	I2C_CR1_SMBTYPE		3
#define	I2C_CR1_ENARP		4
#define	I2C_CR1_ENPEC		5
#define	I2C_CR1_ENGC		6
#define	I2C_CR1_NOSTRETCH	7
#define	I2C_CR1_START		8
#define	I2C_CR1_STOP		9
#define	I2C_CR1_ACK			10
#define	I2C_CR1_SWRST		15

//CR2
#define	I2C_CR2_FREQ		0
#define	I2C_CR2_ITERREN		8
#define	I2C_CR2_ITEVTEN		9
#define	I2C_CR2_ITBUFEN		10
#define	I2C_CR2_DMAEN		11

//SR1
#define	I2C_SR1_SB			0
#define	I2C_SR1_ADDR		1
#define	I2C_SR1_BTF			2
#define	I2C_SR1_ADD10		3
#define	I2C_SR1_STOPF		4
#define	I2C_SR1_RXNE		6
#define	I2C_SR1_TXE			7
#define	I2C_SR1_BERR		8
#define	I2C_SR1_ARLO		9
#define	I2C_SR1_AF			10
#define	I2C_SR1_OVR			11
#define	I2C_SR1_TIMEOUT		14

//SR2
#define	I2C_SR2_MSL			0
#define	I2C_SR2_BUSY		1
#define	I2C_SR2_TRA			2
#define	I2C_SR2_GENCALL		4
#define	I2C_SR2_DUALF		7

//CCR
#define	I2C_CCR_CCR			0
#define	I2C_CCR_DUTY		14
#define	I2C_CCR_FS			15

/******************************************************************************/
/*				Bit position definition of I2C Peripheral					***/
/******************************************************************************/
//SR
#define	USART_SR_PE			0
#define	USART_SR_FE			1
#define	USART_SR_NF			2
#define	USART_SR_ORE		3
#define	USART_SR_IDLE		4
#define	USART_SR_RXNE		5
#define	USART_SR_TC			6
#define	USART_SR_TXE		7
#define	USART_SR_LBD		8
#define	USART_SR_CTS		9

//CR1
#define	USART_CR1_SBK		0
#define	USART_CR1_RE		2
#define	USART_CR1_TE		3
#define	USART_CR1_IDLEIE	4
#define	USART_CR1_RXNEIE	5
#define	USART_CR1_TCIE		6
#define	USART_CR1_TXEIE		7
#define	USART_CR1_PS		9
#define	USART_CR1_PCE		10
#define	USART_CR1_M			12
#define	USART_CR1_UE		13
#define	USART_CR1_OVER8		15

//CR2
#define	USART_CR2_ADD		0
#define	USART_CR2_CPHA		9
#define	USART_CR2_CPOL		10
#define	USART_CR2_CLKEN		11
#define	USART_CR2_STOP		12

//CR3
#define	USART_CR3_EIE		0
#define	USART_CR3_HDSEL		3
#define	USART_CR3_RTSE		8
#define	USART_CR3_CTSE		9
#define	USART_CR3_CTSIE		10
#define	USART_CR3_ONEBIT	11

//BRR
#define	USART_BRR_DIV_MANTISSA	4

#include "stm32f46xx_gpio_driver.h"
#include "stm32f46xx_spi_driver.h"
#include "stm32f46xx_i2c_driver.h"
#include "stm32f46xx_usart_driver.h"
#include "stm32f46xx_rcc_driver.h"

#endif /* INC_STM32F46XX_H_ */
